app/services/authentication_service.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ana@example.com"], ["LIMIT", 1]]
---
  def self.authenticate(email, password)
    user = User.find_by(email: email)