app/views/books/index.html.erb

              <span class="text-sm font-bold text-gray-700">
                <%= book.reviews.count %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" IN ($1, $2, $3, $4, $5, $6, $7, $8)  [["book_id", 1], ["book_id", 2], ["book_id", 3], ["book_id", 4], ["book_id", 5], ["book_id", 6], ["book_id", 7], ["book_id", 8]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."book_id" = $1  [["book_id", 3]]