app/views/books/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = $1 ORDER BY "reviews"."created_at" DESC  [["book_id", 1]]
---
                    <div class="w-10 h-10 <%= review.user.banned? ? 'bg-gray-400' : 'bg-gradient-to-br from-purple-300 to-blue-500' %> rounded-full flex items-center justify-center text-white font-bold shadow-lg">
                      <%= review.reviewer_name.first.upcase %>