app/controllers/books_controller.rb

  def index
    @books = Book.includes(:reviews).order(:title)
---
SELECT "books".* FROM "books" ORDER BY "books"."title" ASC
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" IN ($1, $2, $3, $4, $5, $6, $7, $8)  [["book_id", 1], ["book_id", 2], ["book_id", 3], ["book_id", 4], ["book_id", 5], ["book_id", 6], ["book_id", 7], ["book_id", 8]]

  def create
    @book = Book.new(book_params)

    if @book.save
---
INSERT INTO "books" ("title", "author", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "sdfdsds"], ["author", "dsfds"], ["created_at", "2025-10-27 20:15:37.254580"], ["updated_at", "2025-10-27 20:15:37.254580"]]

  def update
    if @book.update(book_params)
---
UPDATE "books" SET "author" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["author", "dsa"], ["updated_at", "2025-10-27 13:44:38.551321"], ["id", 10]]

  def load_reviews
    @book.reviews.includes(:user).order(created_at: :desc)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = $1 ORDER BY "reviews"."created_at" DESC  [["book_id", 3]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3)  [["id", 3], ["id", 2], ["id", 1]]