app/controllers/reviews_controller.rb

  def create
    @review = build_review_with_user

    if @review.save
---
INSERT INTO "users" ("name", "email", "banned", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "dfsf"], ["email", "dfsf@example.com"], ["banned", false], ["created_at", "2025-10-27 13:09:37.118846"], ["updated_at", "2025-10-27 13:09:37.118846"]]
INSERT INTO "reviews" ("book_id", "user_id", "rating", "content", "created_at", "updated_at", "reviewer_name") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["book_id", 9], ["user_id", 7], ["rating", 5], ["content", "sdfsf"], ["created_at", "2025-10-27 13:09:37.122197"], ["updated_at", "2025-10-27 13:09:37.122197"], ["reviewer_name", "dfsf"]]

  def set_book
    @book = Book.find(params[:book_id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def set_review
    @review = @book.reviews.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."book_id" = $1 AND "reviews"."id" = $2 LIMIT $3  [["book_id", 10], ["id", 15], ["LIMIT", 1]]

  def find_or_create_user(name)
    # Buscar usuario existente no baneado con ese nombre
    User.find_or_create_by(name: name, banned: false) do |user|
---
INSERT INTO "users" ("name", "email", "banned", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "dfsf"], ["email", "dfsf@example.com"], ["banned", false], ["created_at", "2025-10-27 13:09:37.118846"], ["updated_at", "2025-10-27 13:09:37.118846"]]
SELECT "users".* FROM "users" WHERE "users"."name" = $1 AND "users"."banned" = $2 LIMIT $3  [["name", "dfsf"], ["banned", false], ["LIMIT", 1]]