app/controllers/reviews_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def load_reviews_for_error
    @reviews = @book.reviews.with_users.ordered_by_created