app/controllers/users_controller.rb

  def ban
    @user.update(banned: true)
---
UPDATE "users" SET "banned" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["banned", true], ["updated_at", "2025-10-27 20:16:05.828750"], ["id", 5]]

  def unban
    @user.update(banned: false)
---
UPDATE "users" SET "banned" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["banned", false], ["updated_at", "2025-10-27 20:35:16.676460"], ["id", 3]]